content/man/man1/git-grep.1.org
* EXAMPLES
*git grep time_t -- *.[ch]*

#+begin_quote
Looks for *time_t* in all tracked .c and .h files in the working
directory and its subdirectories.

#+end_quote

*git grep -e #define --and \( -e MAX_PATH -e PATH_MAX \)*

#+begin_quote
Looks for a line that has *#define* and either *MAX_PATH* or *PATH_MAX*.

#+end_quote

*git grep --all-match -e NODE -e Unexpected*

#+begin_quote
Looks for a line that has *NODE* or *Unexpected* in files that have
lines that match both.

#+end_quote

*git grep solution -- :^Documentation*

#+begin_quote
Looks for *solution*, excluding files in *Documentation*.

#+end_quote

* NOTES ON THREADS
The *--threads* option (and the *grep.threads* configuration) will be
ignored when *--open-files-in-pager* is used, forcing a single-threaded
execution.

When grepping the object store (with *--cached* or giving tree objects),
running with multiple threads might perform slower than single-threaded
if *--textconv* is given and there are too many text conversions. Thus,
if low performance is experienced in this case, it might be desirable to
use *--threads=1*.

* CONFIGURATION
Everything below this line in this section is selectively included from
the *git-config*(1) documentation. The content is the same as what's
found there:

grep.lineNumber

#+begin_quote
If set to true, enable *-n* option by default.

#+end_quote

grep.column

#+begin_quote
If set to true, enable the *--column* option by default.

#+end_quote

grep.patternType

#+begin_quote
Set the default matching behavior. Using a value of /basic/, /extended/,
/fixed/, or /perl/ will enable the *--basic-regexp*,
*--extended-regexp*, *--fixed-strings*, or *--perl-regexp* option
accordingly, while the value /default/ will use the
*grep.extendedRegexp* option to choose between /basic/ and /extended/.

#+end_quote

grep.extendedRegexp

#+begin_quote
If set to true, enable *--extended-regexp* option by default. This
option is ignored when the *grep.patternType* option is set to a value
other than /default/.

#+end_quote

grep.threads

#+begin_quote
Number of grep worker threads to use. If unset (or set to 0), Git will
use as many threads as the number of logical cores available.

#+end_quote

grep.fullName

#+begin_quote
If set to true, enable *--full-name* option by default.

#+end_quote

grep.fallbackToNoIndex

#+begin_quote
If set to true, fall back to *git grep --no-index* if *git grep* is
executed outside of a git repository. Defaults to false.

#+end_quote

* GIT
Part of the *git*(1) suite
