public/man/man1/git-grep.1/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>git grep time_t – *.[ch]</strong></p>
<blockquote>
<p>Looks for <strong>time_t</strong> in all tracked .c and .h files in the working
directory and its subdirectories.</p>
</blockquote>
<p>
<strong>git grep -e #define –and \( -e MAX_PATH -e PATH_MAX \)</strong></p>
<blockquote>
<p>Looks for a line that has <strong>#define</strong> and either <strong>MAX_PATH</strong> or <strong>PATH_MAX</strong>.</p>
</blockquote>
<p>
<strong>git grep –all-match -e NODE -e Unexpected</strong></p>
<blockquote>
<p>Looks for a line that has <strong>NODE</strong> or <strong>Unexpected</strong> in files that have
lines that match both.</p>
</blockquote>
<p>
<strong>git grep solution – :^Documentation</strong></p>
<blockquote>
<p>Looks for <strong>solution</strong>, excluding files in <strong>Documentation</strong>.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
NOTES ON THREADS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The <strong>–threads</strong> option (and the <strong>grep.threads</strong> configuration) will be
ignored when <strong>–open-files-in-pager</strong> is used, forcing a single-threaded
execution.</p>
<p>
When grepping the object store (with <strong>–cached</strong> or giving tree objects),
running with multiple threads might perform slower than single-threaded
if <strong>–textconv</strong> is given and there are too many text conversions. Thus,
if low performance is experienced in this case, it might be desirable to
use <strong>–threads=1</strong>.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
CONFIGURATION
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>Everything below this line in this section is selectively included from
the *git-config*(1) documentation. The content is the same as what&#39;s
found there:</p>
<p>
grep.lineNumber</p>
<blockquote>
<p>If set to true, enable <strong>-n</strong> option by default.</p>
</blockquote>
<p>
grep.column</p>
<blockquote>
<p>If set to true, enable the <strong>–column</strong> option by default.</p>
</blockquote>
<p>
grep.patternType</p>
<blockquote>
<p>Set the default matching behavior. Using a value of <em>basic</em>, <em>extended</em>,
<em>fixed</em>, or <em>perl</em> will enable the <strong>–basic-regexp</strong>,
<strong>–extended-regexp</strong>, <strong>–fixed-strings</strong>, or <strong>–perl-regexp</strong> option
accordingly, while the value <em>default</em> will use the
<strong>grep.extendedRegexp</strong> option to choose between <em>basic</em> and <em>extended</em>.</p>
</blockquote>
<p>
grep.extendedRegexp</p>
<blockquote>
<p>If set to true, enable <strong>–extended-regexp</strong> option by default. This
option is ignored when the <strong>grep.patternType</strong> option is set to a value
other than <em>default</em>.</p>
</blockquote>
<p>
grep.threads</p>
<blockquote>
<p>Number of grep worker threads to use. If unset (or set to 0), Git will
use as many threads as the number of logical cores available.</p>
</blockquote>
<p>
grep.fullName</p>
<blockquote>
<p>If set to true, enable <strong>–full-name</strong> option by default.</p>
</blockquote>
<p>
grep.fallbackToNoIndex</p>
<blockquote>
<p>If set to true, fall back to <strong>git grep –no-index</strong> if <strong>git grep</strong> is
executed outside of a git repository. Defaults to false.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
GIT
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
